<?xml version="1.'" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Brave and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.centinel.munki.Brave</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Brave</string>
        <key>NAME</key>
        <string>Brave</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Brave is saving the web by building a new suite of cutting-edge web browsers that feature class leading speed, security and protection, plus a new ad revenue sharing solution to help keep publishers in business.</string>
            <key>developer</key>
            <string>Brave Software Inc.</string>
            <key>category</key>
            <string>Web Browsers</string>
            <key>display_name</key>
            <string>Brave</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>  
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.centinel.download.Brave</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string> 
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict> 
    </array>
</dict>
</plist>
